# DimensionOverrideNearByIsLost Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..DimensionOverrideNearByIsLost Property
BuiltInFailures..::..DimensionFailures Class See Also
---
The dimension segment containing the override(s) shown below has been removed. The override text will no longer appear. [Description]
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DimensionOverrideNearByIsLost { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DimensionOverrideNearByIsLost As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DimensionOverrideNearByIsLost {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace